import 'package:digikala_ui/models/product.dart';

List<Product> products = const [
  Product(
    id: 'e1',
    title: 'هندزفری بلوتوثی لیتو مدل LT7',
    description:
        'در برند لیتو سعی شده است که تمامی محصولات مطابق با استاندارد های جهانی تولید شوند. لیتو می‌خواهد با ایربادز LT7 تمامی نیازهایی را که کاربر از یک ایربادز کاملا بدون سیم نیاز دارد، مرتفع سازد.این ایربادز‌ که دارای طراحی منحصر به‌ فردیست، میزان قدرت بیس بالایی را به کاربران عرضه می‌کند. ظاهر ایربادز های LT7 فوق العاده زیباست. یک LED بسیار کوچک روی هر کدام از ایربادزها قرار دارد که نشان‌دهنده‌ی وضعیت است. زمانی‌ که ایرباد ها را از درون جعبه شارژ بیرون می‌آورید، به‌صورت خودکار روشن می‌شوند. این محصول ازطریق بلوتوث 5 به دستگاه هوشمند متصل می‌شود. انتقال امواج بی‌سیم این ایربادز از طریق نسخه‌ی 5 فناوری بلوتوث صورت می‌گیرد.این ایربادز با 4 میکروفون (2 عدد در هر هدفون) باعث افزایش کیفیت صدا شده شما می توانید با شنیدن صدای بلند و واضح ، از یک صحبت صوتی شفاف و بدون سر و صدا لذت ببرید. هر ایربادز دارای باتری داخلی با ظرفیت 30 میلی‌آمپر است که در مجموع ظرفیت باتری 60 میلی آمپرساعت را به‌ارمغان می‌آورند این ایربادزها در حالت شارژ کامل توانایی پخش موسیقی و برقراری تماس را برای 5 ساعت دارد.از طرف دیگر محفظه‌ی شارژ ایربادزها، دارای یک باتری 300 میلی‌آمپر ساعتی است. این کیس به درگاه USB-C مجهز شده، این بدین معناست که این ایربادز از قابلیت شارژ سریع پشتیبانی میکند. مدت‌زمان شارژ کیس شارژ 1.5 ساعت و ایربادزها نیز 1ساعت است. این ایربادز با داشتن پوشش نانو ، حتی در صورت عرق کردن پس از یک تمرین سخت ، در برابر آب مقاومت می کند ، که گزینه ای ایده آل برای تمرینات سخت و عرق آور است. کنترل عملکردهای LT7 نیز از طریق کنترلرهای لمسی روی هر ایربادز صورت می‌گیرد.شما به راحتی با لمس ایربادزها میتوانید پخش موسیقی را فعال یا غیرفعال کنید.',
    category: ['phones', 'charger'],
    price: 945000,
    beforePrice: 1890000,
    hasOffer: true,
    imagePaths: [
      'assets/image/products/leitu/1.jpg',
      'assets/image/products/leitu/2.jpg',
      'assets/image/products/leitu/3.jpg',
      'assets/image/products/leitu/4.jpg',
      'assets/image/products/leitu/5.jpg',
      'assets/image/products/leitu/6.jpg',
      'assets/image/products/leitu/7.jpg',
      'assets/image/products/leitu/8.jpg',
      'assets/image/products/leitu/9.jpg',
    ],
  ),
  Product(
    id: 'p1',
    title:
        'گوشی موبایل هوآوی مدل nova 10 SE دو سیم کارت ظرفیت 256 گیگابایت و رم 8 گیگابایت',
    description:
        'گوشی‌های هوشمند سری nova هوآوی همواره توانسته‌اند با بهره بردن از مشخصات فنی قدرتمند و قیمتی مقرون به‌صرفه، عملکرد بسیار خوبی را از خود به‌نمایش بگذارند. nova 10 SE هم یکی از این گوشی‌های هوشمند است.در نمای رو‌به‌رویی این گوشی به صفحه‌نمایش با ابعاد 6.67 اینچ و رزولوشن 1080×2400 پیکسل از نوع اولد مجهز شده که سوای ارائه کیفیت رنگ بسیار بالا، در شرایط نوری متنوع هم وضوح تصویر بسیار خوبی دارد. در قسمت پشتی این گوشی سه سنسور دوربین در نظر گرفته شده که سنسور دوربین اصلی 108 مگاپیکسل خودنمایی می‌کند. این سنسور امکان ثبت تصاویر جذاب و با‌کیفیتی را در نور روز و نور شب فراهم کرده است. سنسور 8 مگاپیکسل فوق عریض برای ثبت تصاویر با زاویه دید گسترده (عکاسی در طبیعت و عکس‌های دسته‌جمعی) و سنسور 2 مگاپیکسل ماکرو برای ثبت تصاویر از فاصله نزدیک، دو سنسور دوربین دیگر این گوشی هوشمند را تشکیل می‌دهند. برای دوربین سلفی هم سنسور با رزولوشن 16 مگاپیکسل در نظر گرفته شده که عملکرد بسیار خوبی در نور روز دارد. پردازنده اسنپدراگون 680G 4G هم این گوشی را همراهی می‌کند و سبب شده تا هوآوی nova 10 SE در اجرای بازی‌های محبوب و نرم‌افزار‌های پرکاربرد، عملکرد بسیار خوبی داشته باشد. باتری با میزان ظرفیت 4500 میلی‌آمپر‌ساعت و پشتیبانی از فناوری شارژ سریع 66 وات، از دیگر مشخصات در نظر گرفته شده برای این گوشی است. در مجموع باید بگوییم که اگر به دنبال خرید گوشی هوشمند میان‌رده‌ای هستید که از صفحه‌نمایش قدرتمند و بسیار روان، سنسور دوربین اصلی قدرتمند، پردازنده مناسب برای اجرای بازی بهره برده باشد، هوآوی nova 10 SE در این بازه قیمتی می‌تواند یکی از بهترین انتخاب‌های ممکن برای شما باشد.',
    category: ['phones', 'phone'],
    price: 14299000,
    beforePrice: 15000000,
    hasOffer: true,
    imagePaths: [
      'assets/image/products/HNova10/HNova10-1.jpg',
      'assets/image/products/HNova10/HNova10-2.jpg',
      'assets/image/products/HNova10/HNova10-3.jpg'
    ],
  ),
  Product(
    id: 'p2',
    title:
        'گوشی موبایل اپل مدل iPhone 13 CH دو سیم‌ کارت ظرفیت 256 گیگابایت و رم 4 گیگابایت - نات اکتیو',
    description:
        'گوشی موبایل «iPhone 13» پرچم‌دار جدید شرکت اپل است که با چند ویژگی جدید و دوربین دوگانه روانه بازار شده است. نمایشگر آیفون 13 به پنل Super Retina مجهز ‌شده است تا تصاویر بسیار مطلوبی را به کاربر عرضه کند. این نمایشگر رزولوشن بسیار بالایی دارد؛ به‌طوری‌که در اندازه­‌ی 6.1 اینچی‌اش، حدود 460 پیکسل را در هر اینچ جا داده است. روکش سرامیکی صفحه‌نمایش این گوشی می‌تواند انقلابی در محافظت به‌پا کند. ازنظر سخت‌‌افزاری هم این گوشی از تراشه­‌ی جدید A15 بهره می‌برد که دارای 15 میلیارد ترانزیستور است که دارای کنترل گرمای مطلوبی بوده که تا بتواند علاوه بر کارهای معمول، از قابلیت‌های جدید واقعیت مجازی که اپل این روزها روی آن تمرکز خاصی دارد، پشتیبانی کند. به گفته خود شرکت اپل این گوشی دارای سرعتی 50 برابر نسخه 12 خود است. پردازنده دارای ماژولار جدیدی است که مصرف باتری را بسیار پایین‌تر آورده است و شما دارای حفظ باتری بالاتری هستید. اپل در این سری از گوشی‌های iPhone خود پردازنده گرافیکی‌ را قرار داده که از سری 12 گوشی‌های خود 30 درصد سریع‌تر است و این نویدبخش آن است که شما می‌توانید بازی‌هایی را با گرافیک و MAP سنگین تر و بزرگ‌تر اجرا کنید. یکی از ویژگی‌هایی که در iPhone 13 شاهد هستیم سیستم فیلمبرداری ProRes سینمایی آن است که می تواند انقلابی در فیلمبرداری گوشی‌های موبایل به‌راه انداخته باشد. این قابلیت می‌تواند نسبت به صورت روبرو بین افراد و یا بین فرد و اشیا فوکوس و بِلار داشته باشد. گوشی‌های نات اکتیو با قرار گرفتن سیم‌کارت‌های داخلی اکتیو می‌شوند و برخلاف مدل اکتیو پلمپ کالا باز نشده است. گوشی‌های اکتیو برند اپل هم به این شکل هستند که به دلیل محدودیت‌های برخی از محصولات اپل برای کشور ایران، در کشور‌های همسایه به‌صورت رسمی با یک بار قرار گرفتن سیم‌کارت، اکتیو شده و پلمپ می‌شوند و باید بدانید که این پروسه هیچ مشکلی در راستای گارانتی کالا به‌همراه ندارد. پارت‌نامبر‌های اروپا و ژاپن و امارات تک سیم‌کارت هستند و پارت‌نامبر‌های مربوط به امارات هم از فیس تایم پشتیبانی نمی‌کنند. پارت‌نامبر JA (ژاپن) هم حتی در حالت سایلنت صدای شاتر عکس قطع نمی‌شود.',
    category: ['phones', 'phone'],
    price: 45800000,
    beforePrice: 55000000,
    hasOffer: true,
    imagePaths: [
      'assets/image/products/iphone13/1.png',
      'assets/image/products/iphone13/2.jpg',
      'assets/image/products/iphone13/3.jpg',
      'assets/image/products/iphone13/4.jpg',
      'assets/image/products/iphone13/5.jpg',
      'assets/image/products/iphone13/6.jpg',
      'assets/image/products/iphone13/7.jpg',
      'assets/image/products/iphone13/8.jpg',
    ],
  ),
];

// List<Product> offerProducts = const [
//   Product(
//     id: 'e1',
//     title: 'هندزفری بلوتوثی لیتو مدل LT7',
//     description:
//         'در برند لیتو سعی شده است که تمامی محصولات مطابق با استاندارد های جهانی تولید شوند. لیتو می‌خواهد با ایربادز LT7 تمامی نیازهایی را که کاربر از یک ایربادز کاملا بدون سیم نیاز دارد، مرتفع سازد.این ایربادز‌ که دارای طراحی منحصر به‌ فردیست، میزان قدرت بیس بالایی را به کاربران عرضه می‌کند. ظاهر ایربادز های LT7 فوق العاده زیباست. یک LED بسیار کوچک روی هر کدام از ایربادزها قرار دارد که نشان‌دهنده‌ی وضعیت است. زمانی‌ که ایرباد ها را از درون جعبه شارژ بیرون می‌آورید، به‌صورت خودکار روشن می‌شوند. این محصول ازطریق بلوتوث 5 به دستگاه هوشمند متصل می‌شود. انتقال امواج بی‌سیم این ایربادز از طریق نسخه‌ی 5 فناوری بلوتوث صورت می‌گیرد.این ایربادز با 4 میکروفون (2 عدد در هر هدفون) باعث افزایش کیفیت صدا شده شما می توانید با شنیدن صدای بلند و واضح ، از یک صحبت صوتی شفاف و بدون سر و صدا لذت ببرید. هر ایربادز دارای باتری داخلی با ظرفیت 30 میلی‌آمپر است که در مجموع ظرفیت باتری 60 میلی آمپرساعت را به‌ارمغان می‌آورند این ایربادزها در حالت شارژ کامل توانایی پخش موسیقی و برقراری تماس را برای 5 ساعت دارد.از طرف دیگر محفظه‌ی شارژ ایربادزها، دارای یک باتری 300 میلی‌آمپر ساعتی است. این کیس به درگاه USB-C مجهز شده، این بدین معناست که این ایربادز از قابلیت شارژ سریع پشتیبانی میکند. مدت‌زمان شارژ کیس شارژ 1.5 ساعت و ایربادزها نیز 1ساعت است. این ایربادز با داشتن پوشش نانو ، حتی در صورت عرق کردن پس از یک تمرین سخت ، در برابر آب مقاومت می کند ، که گزینه ای ایده آل برای تمرینات سخت و عرق آور است. کنترل عملکردهای LT7 نیز از طریق کنترلرهای لمسی روی هر ایربادز صورت می‌گیرد.شما به راحتی با لمس ایربادزها میتوانید پخش موسیقی را فعال یا غیرفعال کنید.',
//     category: ['phones', 'charger'],
//     price: 945000,
//     beforePrice: 1890000,
//     imagePaths: [
//       'assets/image/products/leitu/1.jpg',
//       'assets/image/products/leitu/2.jpg',
//       'assets/image/products/leitu/3.jpg',
//       'assets/image/products/leitu/4.jpg',
//       'assets/image/products/leitu/5.jpg',
//       'assets/image/products/leitu/6.jpg',
//       'assets/image/products/leitu/7.jpg',
//       'assets/image/products/leitu/8.jpg',
//       'assets/image/products/leitu/9.jpg',
//     ],
//   ),
// ];
