import 'package:digikala_ui/models/product.dart';

List<Product> products = const [
  Product(
    title:
        'گوشی موبایل هوآوی مدل nova 10 SE دو سیم کارت ظرفیت 256 گیگابایت و رم 8 گیگابایت',
    description:
        'گوشی‌های هوشمند سری nova هوآوی همواره توانسته‌اند با بهره بردن از مشخصات فنی قدرتمند و قیمتی مقرون به‌صرفه، عملکرد بسیار خوبی را از خود به‌نمایش بگذارند. nova 10 SE هم یکی از این گوشی‌های هوشمند است.در نمای رو‌به‌رویی این گوشی به صفحه‌نمایش با ابعاد 6.67 اینچ و رزولوشن 1080×2400 پیکسل از نوع اولد مجهز شده که سوای ارائه کیفیت رنگ بسیار بالا، در شرایط نوری متنوع هم وضوح تصویر بسیار خوبی دارد. در قسمت پشتی این گوشی سه سنسور دوربین در نظر گرفته شده که سنسور دوربین اصلی 108 مگاپیکسل خودنمایی می‌کند. این سنسور امکان ثبت تصاویر جذاب و با‌کیفیتی را در نور روز و نور شب فراهم کرده است. سنسور 8 مگاپیکسل فوق عریض برای ثبت تصاویر با زاویه دید گسترده (عکاسی در طبیعت و عکس‌های دسته‌جمعی) و سنسور 2 مگاپیکسل ماکرو برای ثبت تصاویر از فاصله نزدیک، دو سنسور دوربین دیگر این گوشی هوشمند را تشکیل می‌دهند. برای دوربین سلفی هم سنسور با رزولوشن 16 مگاپیکسل در نظر گرفته شده که عملکرد بسیار خوبی در نور روز دارد. پردازنده اسنپدراگون 680G 4G هم این گوشی را همراهی می‌کند و سبب شده تا هوآوی nova 10 SE در اجرای بازی‌های محبوب و نرم‌افزار‌های پرکاربرد، عملکرد بسیار خوبی داشته باشد. باتری با میزان ظرفیت 4500 میلی‌آمپر‌ساعت و پشتیبانی از فناوری شارژ سریع 66 وات، از دیگر مشخصات در نظر گرفته شده برای این گوشی است. در مجموع باید بگوییم که اگر به دنبال خرید گوشی هوشمند میان‌رده‌ای هستید که از صفحه‌نمایش قدرتمند و بسیار روان، سنسور دوربین اصلی قدرتمند، پردازنده مناسب برای اجرای بازی بهره برده باشد، هوآوی nova 10 SE در این بازه قیمتی می‌تواند یکی از بهترین انتخاب‌های ممکن برای شما باشد.',
    category: ['phones', 'phone'],
    price: 14299000,
    imagePaths: [
      'assets/image/products/HNova10-1.jpg',
      'assets/image/products/HNova10-2.jpg'
      'assets/image/products/HNova10-3.jpg'
    ],
  ),
];
